[
  {
    "id": "krMsDwAAQBAJ",
    "volumeInfo": {
      "title": "Paquete Digital Canción de Hielo y Fuego (5 libros)",
      "authors": [
        "George R. R. Martin"
      ],
      "description": "<p> <b>La monumental saga de fantasía épica del escritor George R. R. Martin, que inspiró la aclamada serie televisiva de HBO: <i>Game of Thrones</i>.</b> </p> <p> <p> <b>Ahora reunida por primera vez en un paquete digital.</b> </p> <p> <p> <b>\"Una de las mejores series en la historia de la literatura fantástica\"-Los Angeles Times-</b> </p> <p> <p> <b>Libro 1. <i>Juego de tronos</i>:</b>En el legendario mundo de los Siete Reinos, lord Stark y su familia se encuentran en el centro de un conflicto que desatará todas las pasiones y la más mortal de las batallas...</p> <p> <b>Libro 2. <i>Choque de reyes</i>:</b> Cuatro nobles se proclaman, a la vez, reyes legítimos, y las tierras de Poniente se estremecen entre guerras y traiciones. Un horror presidido por la más ominosa de las señales: un inmenso cometa color sangre suspendido en el cielo.</p> <p> <b>Libro 3. <i>Tormenta de espadas</i>:</b> Mientras empeoran la violencia y el clima en los Siete Reinos, otra fuerza armada, surge desde más allá del Muro de Hielo: se trata de los Otros, un ejército sobrenatural de muertos vivientes, cuyos cuerpos inertes no podrán ser detenidos.</p> <p> <b>Libro 4. <i>Festín de cuervos</i>:</b> Luego de siglos de guerras descarnadas, los siete poderes que dividen la tierra han alcanzado una difícil tregua. Pero no pasa mucho tiempo antes de que los sobrevivientes, los proscritos, los renegados y los carroñeros de los Siete Reinos se reúnan...</p> <p> <b>Libro 5. <i>Danza de dragones</i>:</b> De todos los rincones, enconados conflictos cobran nuevos bríos, traiciones íntimas se perpetran y un gran elenco de proscritos y sacerdotes, soldados y criaturas camaleónicas, nobles y esclavos, enfrentarán obstáculos en apariencia insuperables.</p>",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=krMsDwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE70rQYtGM3yghKkUO0Yi6RPbInCvIikcO79qnp6cdvt-NrYOMFg3XPhPWgK972Cu6agA7QBayZC9wZCTn2FmH7S4ckS3lZa4HHUM2ADbPWl_P9aoZ7Z7WJ926cJKuhfyXlaE2QtQ&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 33.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "DYmUGGwZ8_oC",
    "volumeInfo": {
      "title": "El Señor de los Anillos no 01/03 La Comunidad del Anillo (edición revisada)",
      "authors": [
        "J. R. R. Tolkien"
      ],
      "description": "<p> <b>Primera entrega de la trilogía.</b> </p> <p>«Este libro es como un relámpago en un cielo claro. Decir que la novela heroica, espléndida, elocuente y desinhibida, ha retornado de pronto en una época de un antirromanticismo casi patológico, sería inadecuado. Para quienes vivimos en esa extraña época, el retorno —y el alivio que nos trae— es sin duda lo más importante. Pero para la historia misma de la novela —una historia que se remonta a la Odisea y a antes de la Odisea— no es un retorno, sino un paso adelante o una revolución: la conquista de un territorio nuevo.» —C.S. Lewis, Time & Tide, 1954</p> <p>«La obra de Tolkien, difundida en millones de ejemplares, traducida a docenas de lenguas, inspiradora de slogans pintados en las paredes de Nueva York y de Buenos Aires... una coherente mitología de una autenticidad universal creada en pleno siglo veinte.» —George Steiner, Le Monde, 1973</p>",
      "imageLinks": {
        "large": "https://books.google.com/books/content?id=DYmUGGwZ8_oC&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE73jdmoPIykB-7An0mb0G2Iqz0cxlCsfEboBHncYTbubE8JKEYp7oGj-JmV8ytDTOo-2FIqZodj2ZEHTzqoSgGlGZdSEOxvHBkcky3UBibLFJG5TMTVof-AxIfC7CsR-L5yWWTM_&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 5.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "IAF7DwAAQBAJ",
    "volumeInfo": {
      "title": "Las hijas del sol",
      "authors": [
        "Mariana Guarinoni"
      ],
      "description": "<p> <b>Romance, intrigas y una trama policial en esta ficción que entreteje el pasado con el presente: de la princesa inca Maytanchi a la periodista Nadia Calderón, de la caída de un imperio a la ambición por encontrar un tesoro milenario. Y como siempre, eterno, el amor, que no conoce el tiempo. </b> </p> <br> <p>Cuando Nadia Calderón, periodista aficionada a la arqueología, encuentra un manuscrito en una cueva en las montañas, descubre la historia de la princesa inca Maytanchi y sus primas, <b>las Hijas del Sol</b>, elegidas para servir al dios Inti. Cuando los españoles se apoderan del imperio, Maytanchi es entregada como obsequio a un capitán español, La princesa se desespera porque todo lo que quiere desaparece, pero pronto conocerá a un cacique rebelde y el amor lo cambiará todo.</p> <p>Del pasado de Maytanchi al presente de Nadia, a la luz del manuscrito, la joven periodista cree que hay indicios para encontrar el tesoro perdido de Atahualpa. Y alguien más cree lo mismo. La perspicaz Nadia deberá enfrentar muchos peligros para proteger su descubrimiento y conservar la vida.</p> <p>Pasiones desatadas, guerras entre imperios, ambiciones modernas y el amor que es igual en todas las épocas, en esta ficción histórica apasionante.</p>",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=IAF7DwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE73u0lggdmRt2EJ5QU05FwQ66ffrybsFBQLIOAcxOzQHIJ0P3SksFLHa-1ZRByoXD4Uu3E-_xMEp37dUXBJiYk1pKqw8nkX7smo-QxTJIN-jtsdwye6AAvTMMN4-Bm7lgiUCggE-&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 8.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "tM82AwAAQBAJ",
    "volumeInfo": {
      "title": "Festín de cuervos (Canción de Hielo y Fuego 4)",
      "authors": [
        "George R. R. Martin"
      ],
      "description": "<p>Luego de siglos de guerras descarnadas, los siete poderes que dividen la tierra han alcanzado una difícil tregua. Pero no pasa mucho tiempo antes de que los sobrevivientes, los proscritos, los renegados y los carroñeros de los Siete Reinos se reúnan...</p> <p> <b> <i>Festín de cuervos</i> es el cuarto volumen de Canción de hielo y fuego, la monumental saga de fantasía épica del escritor George R. R. Martin que ha vendido más de 20 millones de ejemplares en todo el mundo.</b> </p> <p> <b>La saga que inspiró la filmación de la aclamada serie televisiva de HBO: <i>Game of Thrones</i>.</b> </p> <p>Cuando se apaga el clamor de las espadas, solamente queda carroña para los cuervos. Luego de siglos de guerras descarnadas, los siete poderes que dividen la tierra se han diezmado unos a otros hasta alcanzar una difícil tregua. Muy pocos reclamos legítimos existen ya por el Trono de Hierro, y la guerra que ha convertido al mundo en poco más que un desierto al fin ha terminado. O eso parece. Pero no pasa mucho tiempo antes de que los sobrevivientes, los proscritos, los renegados y los carroñeros de los Siete Reinos se reúnan.</p> <p>Ahora, como cuervos humanos que acechan un banquete de cenizas, nuevas intrigas y peligrosas alianzas se forman, a la vez que rostros sorprendentes algunos familiares, otros desconocidos emergen de un siniestro crepúsculo de caos y luchas pasadas para asumir los desafíos de los terribles tiempos que se avecinan. Nobles y plebeyos, soldados y hechiceros, asesinos y sabios se unen para hacer valer su vida y sus fortunas. Porque en un festín de cuervos, muchos son los invitados... pero sólo unos pocos logran sobrevivir.</p>",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=tM82AwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE72Tfmt8jcmZQuwuN8W26mudP6lvcQ046K9LNE6PXVTLrv2onVQqOaUgnt4uAe1WXwLlzlyIrxmTL6iT_WBb3KfpYwwOTdZo1fjmshfIl2HKB_Fpgng4tFE803-Az-e9j4yRwt_g&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 15.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "oDzZDgAAQBAJ",
    "volumeInfo": {
      "title": "Alicia en el país de las maravillas",
      "authors": [
        "Lewis Carroll"
      ],
      "description": "Una adaptación para chicos del clásico de Lewis Carroll. Alicia es una pequeña niña que se encuentra descansando junto a su hermana a orillas del río cuando, de repente, ve un conejo blanco que pasa apurado cerca de ella. ¿Adónde la llevará ese misterioso conejo? A una de las aventuras más leídas y conocidas de la historia de la literatura, un mundo donde las cartas de la baraja cobran vida, los gatos aparecen y desaparecen y existe una Reina que ama tanto el croquet como cortar cabezas. Un mundo maravilloso que Alicia descubrirá con decisión y valentía, asombrada por los extraños personajes que se despliegan ante ella.",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=oDzZDgAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE73FY6i2kA8yM02QLs0Ym79IU6ei_8Kp-0xqqfJ2NnY85PAXixaVMV1oKzrwQ7OKTWl2ZxuE6npi6S-6E3cGkbOQfr0eID63-EMrdQVT42AKshoDdJQXCTH_xGRpCTMN29rECIla&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 4.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "uf5NEAAAQBAJ",
    "volumeInfo": {
      "title": "Saga Dune 1-6. La mayor epopeya de todos los tiempos",
      "authors": [
        "Frank Herbert"
      ],
      "description": "<p> <b>Esta</b> <b>imponente edición estuche reúne los</b> <b>seis primeros volúmenes en edición actualizada de «Dune», la saga que se convirtió en un fenómeno de culto desde</b> <b>su publicación</b> <b>hace ya más de medio siglo.</b> </p> <p>En un futuro lejano, en un planeta remoto, se libra una compleja lucha que tendrá repercusiones en toda la galaxia. En las arenas de Akarris, más conocido como Dune, aprender a sobrevivir no es suficiente...</p> <p>Este estuche contiene los volúmenes: <br> <b>1.</b> Dune <br> <b>2.</b> El mesías de Dune <br> <b>3.</b> Hijos de Dune <br> <b>4.</b> Dios emperador de Dune <br> <b>5.</b> Herejes de Dune <br> <b>6.</b> Casa capitular Dune</p> <p> <b>Esta saga apasionante plantea por primera vez de forma completa, racional y convincente todo un mundo absolutamente diferente del nuestro. Sus referencias a los problemas ecológicos, el poder de las drogas y la fuerza de los mitos la han convertido en una obra de culto para millones de lectores en todo el mundo.</b> </p> <p> <b>Reseñas:</b> <br> «No conozco nada comparable, excepto <i>El Señor de los Anillos</i>.» <br> Arthur C. Clarke</p> <p>«Es muy probable que <i>Dune</i> sea más vigente a día de hoy que cuando salió a la luz.» <br> <i>The New</i> <i>Yorker</i> </p> <p>«Uno de los monumentos de la ciencia-ficción moderna.» <br> <i>The Chicago</i> <i>Tribune</i> </p> <p>«Un fenómeno impresionante.» <br> <i>The Washington Post</i> </p> <p>«La más gran novela de ciencia-ficción que ha habido. Star Wars no existiría sin ella.» <br> <i>The Guardian</i> </p> <p>«Simplemente perfecta.» <br> <i>The New York Times</i> </p>",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=uf5NEAAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE73DjbfXlLAALdm_xMMUAtaHflC1-O8q5Kje1ZVxmTBzZ6knVaWQcla_wHGYWLV4jH_p1TrHb43xwkhik8ZDkd0Z_uH9bAZWc1EZ0EUdG2YoF0O0SlRQIW0im9nh9eKSwxkyZNUj&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 31.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "FYt8DwAAQBAJ",
    "volumeInfo": {
      "title": "Dr. Jekyll y Mr. Seek",
      "authors": [
        "Anthony O'Neill"
      ],
      "description": "<p> <b>Una secuela brillante y deliciosa de una de las obras maestras de la literatura.</b> </p> <p> <p> <b>El extraño caso del Dr. Jekyl y Mr. Hyde continúa...</b> </p> <p>Siete años después de la muerte de Edward Hyde, un elegante caballero aparece por las calles de Londres reclamando que es el Dr. Henry Jekyll. Tan solo el Sr. Utterson, abogado y confidente del Dr. Jekyll sabe que es un impostor, porque Jekyll era Hyde.</p> <p>Pero mientras este misterioso hombre se va relacionando con la alta sociedad londinense, y va reclamando sus bienes, los cuerpos de sus posibles enemigos van desapareciendo, Utterson comienza a temer por su vida y a cuestionarse su propia cordura.</p> <p>Una secuela brillante y deliciosa de una de las obras maestras de la literatura que cumple a la perfección como complemento a la historia original que lidiaba con aspectos sobre la dualidad del ser humano, mientras que es esta secuela el autor ahonda en el audaz robo de la identidad.</p> <p>¿Puede ser que este hombre que parece y actúa tan parecido al Dr. Henry Jekyll sea un realidad un impostor?</p> <p> <b>La crítica ha dicho...</b> <br> «Anthony O'Neill realiza su más sincero homenaje a Stevenson. Todo emana esa esencia del original. Aunque en esta ocasión, la propuesta de O'Neill se aleja del terror gótico y profundiza en la intriga. Francamente, debería ser una lectura obligada.» <br> <i>Edición original</i> </p>",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=FYt8DwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE70V2jojEeNJUHg-YhWQHKHhpCa4y3Og8O4n8gAxFex1hh0as-Z3Xmzo1sNRGf_zZDNRwt0Rn-KBFxNZRnrTuk-vu34O0_owxuIs1WCfIxrVqS8W_eRkDeBTwKZuuOP8mxdMqdQ7&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 5.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "KK6eEAAAQBAJ",
    "volumeInfo": {
      "title": "El PRINCIPITO",
      "authors": [
        "Antoine de Saint-Exupéry"
      ],
      "description": "<b>Antoine-Marie-Roger de Saint-Exupéry</b> (1900 - 1944) fue un escritor y aviador francés conocido principalmente por su novela El Principito. Escrito en Nueva York durante la Segunda Guerra Mundial y ilustrado con sus propias acuarelas, <b>El Principito </b>se publicó en 1943 y logo se convirtió en un gran éxito mundial. El libro é tenido como uno de los mejores de todos los tiempos y un clásico contemporáneo de la literatura universal. Su estilo sencillo aliado a un profundo carácter reflexivo sobre la vida, la sociedad y el amor, lo convierten en una narración de interés para todos. El Principito ha sido traducido a decenas de lenguas y adaptado a diversos formatos, como el teatro, el cine, la serie animada, el ballet y la ópera, siempre con mucho exito.",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=KK6eEAAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE71d8cmd506S6YsgtOtyiBaWQ9GsUtHPu6FjZSVWXbz4QCn6g5PDXhsrbuUeufT0IGBPb0TRjqxIcZ4G7jqs19ucZcCLsDNKwOjrLicZIqgVwD17xmjO3yvWaCPYs4COJEh6iY-F&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 1.86,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "IZWWDwAAQBAJ",
    "volumeInfo": {
      "title": "El nombre del viento (edición de lujo por el 10o aniversario de la publicación)",
      "authors": [
        "Patrick Rothfuss"
      ],
      "description": "<p> <b>Atípica, profunda y sincera, <i>El nombre del viento</i> es una novela de aventuras, de historias dentro de otras historias, de misterio, de amistad, de amor, de magia y de superación que ha deslumbrado -por su originalidad y la maestría con que está narrada- a todos los que la han leído.</b> </p> <p> <p> <b>Esta es una maravillosa edición ilustrada y actualizada para conmemorar el 10o aniversario de la publicación en español de la aclamadísima novela que consagró a Patrick Rothfuss como fenómeno editorial.</b> </p> <p> <b>Desde su publicación en español hace ya una década, </b> <i> <b>El nombre del viento </b> </i> <b>ha embelesado a millones de lectores de todo el mundo. Esta edición conmemorativa y actualizada nos brinda la oportunidad de profundizar en el universo inigualable de Patrick Rothfuss con material inédito que incluye: notas del autor, del editor y de la reconocida escritora Jo Walton, veintiuna magníficas ilustraciones a página completa de Dan Dos Santos, mapas de Nate Taylor y apéndices ilustrados sobre la historia, las monedas y el calendario de los cuatro rincones de la civilización.</b> </p> <p> <b>«Viajé, amé, perdí, confié y me traicionaron». </b> </p> <p>En una posada en tierra de nadie, un hombre se dispone a relatar, por primera vez, la auténtica historia de su vida. Una historia que únicamente él conoce y que ha quedado diluida tras los rumores, las conjeturas y los cuentos de taberna que le han convertido en un personaje legendario a quien todos daban ya por muerto: Kvothe... músico, mendigo, ladrón, estudiante, mago, héroe y asesino.</p> <p> <b>La crítica ha dicho...</b> <br> «Una celebración del gusto de contar historias». <br> <i>El País</i> </p> <p>«Insólita y preciosa. Puntuación: sobresaliente». <br> <i>Qué Leer</i> </p> <p>«Un libro para quien conoce el mágico poder de las palabras». <br> Ricard Ruiz Garzón, <i>El Periódico de Catalunya</i> </p> <p>«Vaya donde vaya Pat Rothfuss con la espléndida historia que comienza con <i>El nombre del viento</i>, nos llevará de la mano como el buen músico nos lleva por una canción». <br> Ursula K. Le Guin</p> <p>«Un libro asombroso». <br> Orson Scott Card</p> <p>«Este Rothfuss es condenadamente bueno.» <br> George R. R. Martin</p> <p>«Patrick Rothfuss me ha recordado a Ursula K. Le Guin, George R.R. Martin y J.R.R. Tolkien, pero en ningún momento he sentido que estuviera imitándolos. Sin duda <i>El nombre del viento</i> se convertirá en un clásico». <br> <i>The Times</i> </p> <p>«Cuando empecéis a leer, preparaos para perder el mundo real de vista y sumergiros en una historia de magia, amor y aventura inmensamente original e hipnótica». <br> <i>The Barnes & Noble Review</i> </p> <p>« <i>El nombre del viento</i> es una de las mejores historias contadas durante la última década. Guardadlo en la estantería al lado de <i>El señor de los anillos</i>». <br> <i>The A.V. Club</i> </p> <p>«Tan absorbente en una segunda lectura como lo es en la primera, este es el tipo de primera novela que la mayoría de los autores tan solo pueden soñar con escribir. El universo de la literatura fantástica tiene una nueva estrella». <br> <i>Publishers Weekly</i> </p>",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=IZWWDwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE71Oplj7xh_DVEyhpCMpfS70AtiOIRyGlirWoMvis88M2oOE9AmOkiWmQ6KhHTZc9rTt11TUXt9SxKbx2XFwMkXzApdmNuxF7lpXSnIfs02WRo9dRsu-0qNJo1711aBDLlI0VgzP&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 17.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "l1-aEAAAQBAJ",
    "volumeInfo": {
      "title": "El león, la bruja y el ropero",
      "authors": [
        "C. S. Lewis"
      ],
      "description": "<p>NARNIA... la tierra que está más allá del ropero, el país secreto que solo conocen Peter, Susan, Edmund y Lucy... el lugar donde comienza la aventura.</p><p>Lucy es la primera en encontrar el secreto del ropero en la vieja y misteriosa casa del profesor. Al principio, nadie le cree cuando cuenta sus aventuras en el país de Narnia. Sin embargo, pronto Edmund y luego Peter y Susan descubren la magia y conocen por sí mismos a Aslan, el Gran León. En un abrir y cerrar de ojos, su vida cambia para siempre.</p><p>Por primera vez, el lenguaje de los siete libros clásicos ha sido adaptado para el lector latinoamericano y editado para garantizar la coherencia de los nombres, personajes, lugares y acontecimientos dentro del universo de Narnia. Además, presentan las cubiertas e ilustraciones originales de Pauline Barnes.</p><p>Aunque forma parte de una saga, este es un libro independiente. Si quieres descubrir más sobre Narnia, puedes leer El caballo y su muchacho, el tercer libro de Las crónicas de Narnia.</p><p>The Lion, The Witch and the Wardrobe</p><p>NARNIA... the land beyond the wardrobe, the secret country that only Peter, Susan, Edmund and Lucy know... the place where adventure begins.</p><p>Lucy is the first to find the secret of the closet in the Professor's mysterious old house. At first, no one believes her when she tells of her adventures in the land of Narnia. Soon, however, Edmund and then Peter and Susan discover the magic and meet Aslan, the Great Lion, for themselves. In the blink of an eye, their lives change forever.</p><p>For the first time, the language of the seven classic books has been adapted for the Latin American reader and edited to ensure consistency of names, characters, places and events within the Narnia universe. In addition, they feature the original covers and illustrations by Pauline Barnes.</p><p>Although it is part of a saga, this is a stand-alone book. If you want to discover more about Narnia, you can read The Horse and His Boy, the third book of The Chronicles of Narnia.</p>",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=l1-aEAAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE72q3XHiB0HDkofGz4R6P3bohq8HO4_QSifELN4mdZtrgc89WhN_jsyJMJYjdrqe-AQY2S8o6F-ri4hR1vvO7Zn_AJ1CvbA-y91RNJF8tMCNeHdY5qYbA-_REc8WivMz5uEGYlRe&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 3.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "jgYmCQAAQBAJ",
    "volumeInfo": {
      "title": "Sherlock Holmes. Relatos 2 (Los mejores clásicos)",
      "authors": [
        "Sir Arthur Conan Doyle"
      ],
      "description": "<p> <b>Tres cautivadoras colecciones de relatos de Sherlock Holmes en un solo volumen.</b> </p> <p> <p> <b>Traducción de Juan Camargo</b> </p> <p> <b>Introducción del crítico literario Andreu Jaume</b> </p> <p>El presente volumen recoge las tres colecciones de relatos que completan el canon holmesiano: <i>El regreso de Sherlock Holmes</i> (1907), <i>Su último saludo</i> (1917) y <i>El archivo de Sherlock Holmes</i> (1927). Tras volver de una muerte que nunca tuvo lugar, Holmes sigue resolviendo los casos más complicados. En «La aventura de la caja de cartón», por ejemplo, debe encontrar al remitente de un horrible paquete que contiene dos orejas humanas. En otras ocasiones, tiene que impedir sucesos casi inevitables, como en «Su último saludo», donde una peligrosa arma no puede caer en manos del enemigo a las puertas de la Gran Guerra. O en «La aventura de la melena de león» donde él mismo narra, mientras disfruta de un merecido retiro en Sussex, cómo atrapó a un extraño animal homicida.</p> <p>Esta edición, que se abre con un estudio introductorio de Andreu Jaume, pretende homenajear el empeño editorial de Esther Tusquets, cuyo proyecto de publicar el canon holmesiano quedó interrumpido. Juan Camargo, experto en novela de masas europea y americana, ha completado la labor traductora.</p>",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=jgYmCQAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE71MAnua9AK9sJ9_bIeMbVNvYtFt-oatVTZekBBXs0h5GBC9fPiStGX9ytetCWhgluKUNDwM3M0yqFFMMkP1IVy19v9OhqhzEq2Jqf_hizlXEQeUMf6BVP54qEnsHnjzvPf06r3A&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 5.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "84Whswqz4rAC",
    "volumeInfo": {
      "title": "Design Patterns Explained",
      "authors": [
        "Alan Shalloway",
        "James R. Trott"
      ],
      "description": "<p>\"One of the great things about the book is the way the authors explain concepts very simply using analogies rather than programming examples–this has been very inspiring for a product I'm working on: an audio-only introduction to OOP and software development.\"</p> <p>–Bruce Eckel</p> <p>\"...I would expect that readers with a basic understanding of object-oriented programming and design would find this book useful, before approaching design patterns completely. <i>Design Patterns Explained </i>complements the existing design patterns texts and may perform a very useful role, fitting between introductory texts such as UML Distilled and the more advanced patterns books.\"</p> <p>–James Noble</p> <p>Leverage the quality and productivity benefits of patterns–without the complexity! <i>Design Patterns Explained, Second Edition</i> is the field's simplest, clearest, most practical introduction to patterns. Using dozens of updated Java examples, it shows programmers and architects exactly how to use patterns to design, develop, and deliver software far more effectively. </p> <p>You'll start with a complete overview of the fundamental principles of patterns, and the role of object-oriented analysis and design in contemporary software development. Then, using easy-to-understand sample code, Alan Shalloway and James Trott illuminate dozens of today's most useful patterns: their underlying concepts, advantages, tradeoffs, implementation techniques, and pitfalls to avoid. Many patterns are accompanied by UML diagrams. </p> <p>Building on their best-selling First Edition, Shalloway and Trott have thoroughly updated this book to reflect new software design trends, patterns, and implementation techniques. Reflecting extensive reader feedback, they have deepened and clarified coverage throughout, and reorganized content for even greater ease of understanding. New and revamped coverage in this edition includes </p> <ul> <li>Better ways to start \"thinking in patterns\" </li> <li>How design patterns can facilitate agile development using eXtreme Programming and other methods </li> <li>How to use commonality and variability analysis to design application architectures </li> <li>The key role of testing into a patterns-driven development process </li> <li>How to use factories to instantiate and manage objects more effectively </li> <li>The Object-Pool Pattern–a new pattern not identified by the \"Gang of Four\" </li> <li>New study/practice questions at the end of every chapter</li> </ul> <p>Gentle yet thorough, this book assumes no patterns experience whatsoever. It's the ideal \"first book\" on patterns, and a perfect complement to Gamma's classic <i>Design Patterns</i>. If you're a programmer or architect who wants the clearest possible understanding of design patterns–or if you've struggled to make them work for you–read this book.</p>",
      "imageLinks": {
        "large": "https://books.google.com/books/content?id=84Whswqz4rAC&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE71mixeTyYup3vbsGRB7JSoN6qKgX2VPlt1CFNI-x7bXwsP51HBHfheczaxTO61pnG3qLZdrVgMQuXDE2b9RD__Ue0c1cAuQmClVuNwVMsaP101HAWGnOWCYioJNxFMBpHNl1fYV&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 57.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "gDNjBgAAQBAJ",
    "volumeInfo": {
      "title": "Relato de un náufrago",
      "authors": [
        "Gabriel García Márquez"
      ],
      "description": "<p> <b>El periplo desnudo y descarnado de un marinero a la deriva.</b> </p> <p> <b>Y el relato que le costó el exilio a Gabriel García Márquez.</b> </p> <p>«Mi libro preferido, y el primero que escribí.» <br> Gabriel García Márquez</p> <p>Con este libro, Gabriel García Márquez se descubrió a sí mismo como un narrador. Sin embargo, la intención primera era escribir un reportaje sobre un hombre, Luis Alejandro Velasco, que estuvo diez días a la deriva en una balsa mecida por el mar Caribe. El futuro Nobel de Literatura y entonces joven reportero que era García Márquez escuchó el relato de los hechos de boca de su protagonista y los transformó, tal vez sin pretenderlo, en un prodigioso ejercicio literario, una narración escueta y vigorosa donde late el pulso de un gran escritor. La publicación por entregas del reportaje en <i>El Espectador</i> de Bogotá supuso un alboroto político considerable -se revelaba la existencia de contrabando ilegal en un buque de la Armada colombiana, lo que costó la vida de siete marineros y el naufragio, más afortunado, de Velasco- y el exilio para su autor.</p> <p> <b>«El 22 de febrero nos anunció que regresaríamos a Colombia. Teníamos ocho meses de estar en Mobile, Alabama, Estados Unidos, donde el A.R.C. <i>Caldas</i> fue sometido a reparaciones electrónicas y de sus armamentos. En los días de franquicia hacíamos lo que hacen todos los marineros en tierra: íbamos al cine con la novia y nos reuníamos después en Joe Palooka, una taberna del puerto, donde tomábamos whisky y armábamos una bronca de vez en cuando.»</b> </p> <p> <b>La crítica dijo...</b> <br> «Su narración más perfecta.» <br> <i>El País</i> </p>",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=gDNjBgAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE70CmYanXUdTe4URrl7x4ts7gsqibYiiZAOg6Z07I71xXwZDmFiK1GvUQ-tIEfU5K8pVD5Vui80ScihS502NVzygU4jIVwyhnmQXELh-wvalzRBeyugn1uzdXrEn9hrWIu4Pbtjh&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 7.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "2H1_DwAAQBAJ",
    "volumeInfo": {
      "title": "Refactoring",
      "authors": [
        "Martin Fowler"
      ],
      "description": "<p>Martin Fowler’s guide to reworking bad code into well-structured code</p> <p>Refactoring improves the design of existing code and enhances software maintainability, as well as making existing code easier to understand. Original Agile Manifesto signer and software development thought leader, Martin Fowler, provides a catalog of refactorings that explains why you should refactor; how to recognize code that needs refactoring; and how to actually do it successfully, no matter what language you use.</p> <ul> <li>Refactoring principles: understand the process and general principles of refactoring</li> <li>Code smells: recognize “bad smells” in code that signal opportunities to refactor</li> <li>Application improvement: quickly apply useful refactorings to make a program easier to comprehend and change</li> <li>Building tests: writing good tests increases a programmer’s effectiveness</li> <li>Moving features: an important part of refactoring is moving elements between contexts</li> <li>Data structures: a collection of refactorings to organize data, an important role in programs</li> <li>Conditional Logic: use refactorings to make conditional sections easier to understand</li> <li>APIs: modules and their functions are the building blocks of our software, and APIs are the joints that we use to plug them together</li> <li>Inheritance: it is both very useful and easy to misuse, and it’s often hard to see the misuse until it’s in the rear-view mirror---refactorings can fix the misuse</li> </ul> <p>Examples are written in JavaScript, but you shouldn’t find it difficult to adapt the refactorings to whatever language you are currently using as they look mostly the same in different languages.</p> <p>\"Whenever you read [Refactoring], it’s time to read it again. And if you haven’t read it yet, please do before writing another line of code.\" –David Heinemeier Hansson, Creator of Ruby on Rails, Founder & CTO at Basecamp</p> <p>“Any fool can write code that a computer can understand. Good programmers write code that humans can understand.” –M. Fowler (1999)</p>",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=2H1_DwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE71z4it-OBYpHFzX3iwIoYhUL__usdjr6ttEqCoPN-xlbKc5SC2MDgbTsdQUyFGbCJSbwMrIES0Vqso2pBg-CJs_xt2yDRoDun1dSUCqNRgnYOfkSpKIni2OjQ7JffAOABrPvEIF&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 57.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "H8Y1EQAAQBAJ",
    "volumeInfo": {
      "title": "1984",
      "authors": [
        "George Orwell"
      ],
      "description": "<p> <b>«La guerra es paz. <br>La libertad es esclavitud. <br>La ignorancia es fuerza». </b> </p> <p>Corre el año 1984 y la guerra y la Revolución han dejado el mundo irreconocible. La sociedad está gobernada por el Partido, bajo el liderazgo del Hermano Mayor. La vigilancia masiva lo es todo y la Policía del Pensamiento garantiza que no se permita ningún razonamiento individual. Atraído por una aventura amorosa, Winston Smith encuentra el valor para unirse a una organización revolucionaria clandestina llamada la Hermandad, cuyo objetivo es la destrucción del régimen. Pero Winston y su amada Julia se verán enfrentados a las consecuencias de su decisión, y arrojados a lo más profundo del horror y el miedo.</p> <p>Pocos libros han conseguido una influencia tan dominante en la cultura popular como <i>1984</i>, y hoy día sigue vigente su inquietante advertencia contra el totalitarismo.</p>",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=H8Y1EQAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE70w44SubUHTPNXw7307I6-rW0F9kbYWezj8KKjqLzTOX1YZgVlHRhXATFvh4WNmzpp5Vw1J-QD3jI82TVpEJBthgrp78R7qNqEA0AzDE41gPvLKjXi1n13rZHpLjuLs0_3m4vw9&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 5.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "6oHuKQe3TjQC",
    "volumeInfo": {
      "title": "Design Patterns",
      "authors": [
        "Erich Gamma",
        "Richard Helm",
        "Ralph Johnson",
        "John Vlissides"
      ],
      "description": "<p>The Gang of Four’s seminal catalog of 23 patterns to solve commonly occurring design problems</p> <p>Patterns allow designers to create more flexible, elegant, and ultimately reusable designs without having to rediscover the design solutions themselves. Highly influential, Design Patterns is a modern classic that introduces what patterns are and how they can help you design object-oriented software and provides a catalog of simple solutions for those already programming in at last one object-oriented programming language. </p> <p> Each pattern:</p> <ul> <li>Describes the circumstances in which it is applicable, when it can be applied in view of other design constraints, and the consequences and trade-offs of using the pattern within a larger design</li> <li>Is compiled from real systems and based on real-world examples</li> <li>Includes downloadable C++ source code that demonstrates how patterns can be implemented and Python</li> </ul> <p>From the preface: “Once you the design patterns and have had an ‘Aha!’ (and not just a ‘Huh?’) experience with them, you won't ever think about object-oriented design in the same way. You'll have insights that can make your own designs more flexible, modular, reusable, and understandable - which is why you're interested in object-oriented technology in the first place, right?”</p>",
      "imageLinks": {
        "large": "https://books.google.com/books/content?id=6oHuKQe3TjQC&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE72CPdRwLNsUXhEQBY9LfFChAN2bSsgfv8MV7Vi0dEW6FnTVPJQR_R45LqmRg5HWcSos4xhzdQkJ63CL9c96-G8R-I8vBf_fZ-Br-IU_5PWtBOFGvc8SzL189pwMMeVTsVSHMKw0&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 57.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "699qCwAAQBAJ",
    "volumeInfo": {
      "title": "Las aventuras de Don Quijote de la Mancha para niños",
      "authors": [
        "Miguel Cervantes Saavedra"
      ],
      "description": "Don Quijote es un voraz lector de novelas de caballería, esas donde los hombres van a caballo por los campos, combatiendo contra gigantes y liberando princesas que fueron secuestradas por hombres malvados. Nada de lo que cuentan esas historias es cierto, pero Don Quijote no lo sabe. ¡Él mismo quiere convertirse en un valiente caballero andante! Junto con su fiel escudero Sancho Panza, recorrerá los reinos de España en busca de aventuras que lo hagan famoso, mientras suspira por el amor de su amada, la bella doncella Dulcinea del Toboso. Una adaptación para chicos de entre 9 y 12 años del mayor clásico de la literatura en español. Una obra ilustrada a todo color para lectores curiosos y aventureros.",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=699qCwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE72Cd_eNjALftYoSQwLXi9RJ8q7sZHZ86HLbWlXcNT97vWSDDdx89C090NW8pKC-cjs4xF8fO4cj1HxYa2q1oRnX1g6URUp97kh1gz6ON-vlvXWCo8oj85K0BcVJ5OKvpzu6NI_z&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 4.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "Pf70DwAAQBAJ",
    "volumeInfo": {
      "title": "El almohadón de plumas y otros cuentos",
      "authors": [
        "Quiroga, Horacio"
      ],
      "description": "El almohadón de plumas y otros cuentos de Horacio Quiroga es una breve selección de tres cuentos del escritor uruguayo: “El almohadón de plumas” (1917), “A la deriva” (1917) y “La lengua” (1921). “El almohadón de plumas” describe la lucha contra la enfermedad de una recién casada, acompañada de su marido, sus trabajadoras domésticas y los múltiples médicos que intentan sin éxito alguno explicar y aliviar el extraño padecimiento de la mujer. “A la deriva” narra la larga agonía de un hombre que es mordido en una selva alejada de la civilización; el hombre intenta con todas sus fuerzas luchar contra el veneno en un paisaje inhóspito que nos recuerda al Amazonas y a las selvas latinoamericanas poco exploradas en el siglo xix. “La lengua” es un cuento que narra la lucha de un hombre por conseguir venganza en contra de un viejo amigo, sin saber que el concretarla traerá para él consecuencias terribles.",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=Pf70DwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE73oAdPAXW6ATLdMGG2D8LdHXBYcFptuBy1eRH0CAFGb-0i3b-VR54KPgTyaSbH2JXdUDKTZRIayY_bt78bRX2mG4tTP5zBP-VwvSR0dOBUDDSuTimb4V-k2Mlr4vEd6GhE-n5L2&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 0.39,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "USHY7YqtIp8C",
    "volumeInfo": {
      "title": "La interpretación de los sueños",
      "authors": [
        "Sigmund Freud"
      ],
      "description": "En 1899 Freud publicaba por primera vez la obra que sería considerada como la más importante, representativa e influyente de su toda su producción: La interpretación de los sueños. Con ella daba inicio a una nueva disciplina, el psicoanálisis, que proponía el modo a través del cual acceder al inconsciente tomando elementos de las experiencias vividas. Por primera vez se introdujo el concepto del Yo y los sueños fueron objeto de un estudio científico. Gracias al método propuesto por Freud, pudieron interpretarse los contenidos de aquellos, generalmente como la representación de deseos latentes. La interpretación de los sueños es un libro fundamental para quienes quieran conocer o profundizar en las teorías del padre de psicoanálisis.",
      "imageLinks": {
        "large": "https://books.google.com/books/content?id=USHY7YqtIp8C&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE70U7NwOso-YYUfjXYIs28JodjK1LJ2jX36240J_r_QGkxr4rDfPccswliQWxXEvLEVpnIgX-l68znxSCgOwPJJyw9R_ETDDWPw7wk1CsRD6g5lhOkhh1WoynqAF0q9eBUNa2KUA&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 9.72,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "fT1R8r_CkOIC",
    "volumeInfo": {
      "title": "Libro de sueños",
      "authors": [
        "Jorge Luis Borges"
      ],
      "description": "<p> <b>El sueño como el más antiguo y no menos complejo de los géneros literarios. Una asombrosa recopilación de la mano de Jorge Luis Borges.</b> </p> <p>En este volumen, Borges presenta relatos de paisaje onírico de distintas épocas y documenta lo que ha soñado el hombre desde que es hombre, discurriendo por el sendero que va de las primeras civilizaciones a Kafka, revisando los trances proféticos del Antiguo Testamento, las epopeyas clásicas o la filosofía china. Una fabulosa antología, en definitiva, que consagra el sueño como el más antiguo y complejo de los géneros literarios.</p> <p> <i> <b>«Este </b> </i> <b>Libro de sueños</b> <i> <b> que los lectores volverán a soñar abarca sueños de la noche -los que yo firmo, por ejemplo-, sueños del día, que son un ejercicio voluntario de nuestra mente, y otros de raigambre perdida: digamos, el Sueño anglosajón de la Cruz.»</b> </i> </p>",
      "imageLinks": {
        "large": "https://books.google.com/books/content?id=fT1R8r_CkOIC&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE7343SxYXojz9CrtEU4UW8av1sVS1FDWsyHHBuWA4Ptw7hAvhEhvcJqTMTH97kqFQcL6rN215-04UCkCQVzqU9f2161_fZYyI38OLIHbIYDPtQdOTckoCdFg1ONZnc-rDrOer25Q&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 5.99,
        "currencyCode": "USD"
      }
    }
  }
]