[
  {
    "id": "krMsDwAAQBAJ",
    "volumeInfo": {
      "title": "Paquete Digital Canción de Hielo y Fuego (5 libros)",
      "authors": [
        "George R. R. Martin"
      ],
      "description": "<p> <b>La monumental saga de fantasía épica del escritor George R. R. Martin, que inspiró la aclamada serie televisiva de HBO: <i>Game of Thrones</i>.</b> </p> <p> <p> <b>Ahora reunida por primera vez en un paquete digital.</b> </p> <p> <p> <b>\"Una de las mejores series en la historia de la literatura fantástica\"-Los Angeles Times-</b> </p> <p> <p> <b>Libro 1. <i>Juego de tronos</i>:</b>En el legendario mundo de los Siete Reinos, lord Stark y su familia se encuentran en el centro de un conflicto que desatará todas las pasiones y la más mortal de las batallas...</p> <p> <b>Libro 2. <i>Choque de reyes</i>:</b> Cuatro nobles se proclaman, a la vez, reyes legítimos, y las tierras de Poniente se estremecen entre guerras y traiciones. Un horror presidido por la más ominosa de las señales: un inmenso cometa color sangre suspendido en el cielo.</p> <p> <b>Libro 3. <i>Tormenta de espadas</i>:</b> Mientras empeoran la violencia y el clima en los Siete Reinos, otra fuerza armada, surge desde más allá del Muro de Hielo: se trata de los Otros, un ejército sobrenatural de muertos vivientes, cuyos cuerpos inertes no podrán ser detenidos.</p> <p> <b>Libro 4. <i>Festín de cuervos</i>:</b> Luego de siglos de guerras descarnadas, los siete poderes que dividen la tierra han alcanzado una difícil tregua. Pero no pasa mucho tiempo antes de que los sobrevivientes, los proscritos, los renegados y los carroñeros de los Siete Reinos se reúnan...</p> <p> <b>Libro 5. <i>Danza de dragones</i>:</b> De todos los rincones, enconados conflictos cobran nuevos bríos, traiciones íntimas se perpetran y un gran elenco de proscritos y sacerdotes, soldados y criaturas camaleónicas, nobles y esclavos, enfrentarán obstáculos en apariencia insuperables.</p>",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=krMsDwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE70rQYtGM3yghKkUO0Yi6RPbInCvIikcO79qnp6cdvt-NrYOMFg3XPhPWgK972Cu6agA7QBayZC9wZCTn2FmH7S4ckS3lZa4HHUM2ADbPWl_P9aoZ7Z7WJ926cJKuhfyXlaE2QtQ&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 33.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "DYmUGGwZ8_oC",
    "volumeInfo": {
      "title": "El Señor de los Anillos no 01/03 La Comunidad del Anillo (edición revisada)",
      "authors": [
        "J. R. R. Tolkien"
      ],
      "description": "<p> <b>Primera entrega de la trilogía.</b> </p> <p>«Este libro es como un relámpago en un cielo claro. Decir que la novela heroica, espléndida, elocuente y desinhibida, ha retornado de pronto en una época de un antirromanticismo casi patológico, sería inadecuado. Para quienes vivimos en esa extraña época, el retorno —y el alivio que nos trae— es sin duda lo más importante. Pero para la historia misma de la novela —una historia que se remonta a la Odisea y a antes de la Odisea— no es un retorno, sino un paso adelante o una revolución: la conquista de un territorio nuevo.» —C.S. Lewis, Time & Tide, 1954</p> <p>«La obra de Tolkien, difundida en millones de ejemplares, traducida a docenas de lenguas, inspiradora de slogans pintados en las paredes de Nueva York y de Buenos Aires... una coherente mitología de una autenticidad universal creada en pleno siglo veinte.» —George Steiner, Le Monde, 1973</p>",
      "imageLinks": {
        "large": "https://books.google.com/books/content?id=DYmUGGwZ8_oC&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE73jdmoPIykB-7An0mb0G2Iqz0cxlCsfEboBHncYTbubE8JKEYp7oGj-JmV8ytDTOo-2FIqZodj2ZEHTzqoSgGlGZdSEOxvHBkcky3UBibLFJG5TMTVof-AxIfC7CsR-L5yWWTM_&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 5.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "IAF7DwAAQBAJ",
    "volumeInfo": {
      "title": "Las hijas del sol",
      "authors": [
        "Mariana Guarinoni"
      ],
      "description": "<p> <b>Romance, intrigas y una trama policial en esta ficción que entreteje el pasado con el presente: de la princesa inca Maytanchi a la periodista Nadia Calderón, de la caída de un imperio a la ambición por encontrar un tesoro milenario. Y como siempre, eterno, el amor, que no conoce el tiempo. </b> </p> <br> <p>Cuando Nadia Calderón, periodista aficionada a la arqueología, encuentra un manuscrito en una cueva en las montañas, descubre la historia de la princesa inca Maytanchi y sus primas, <b>las Hijas del Sol</b>, elegidas para servir al dios Inti. Cuando los españoles se apoderan del imperio, Maytanchi es entregada como obsequio a un capitán español, La princesa se desespera porque todo lo que quiere desaparece, pero pronto conocerá a un cacique rebelde y el amor lo cambiará todo.</p> <p>Del pasado de Maytanchi al presente de Nadia, a la luz del manuscrito, la joven periodista cree que hay indicios para encontrar el tesoro perdido de Atahualpa. Y alguien más cree lo mismo. La perspicaz Nadia deberá enfrentar muchos peligros para proteger su descubrimiento y conservar la vida.</p> <p>Pasiones desatadas, guerras entre imperios, ambiciones modernas y el amor que es igual en todas las épocas, en esta ficción histórica apasionante.</p>",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=IAF7DwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE73u0lggdmRt2EJ5QU05FwQ66ffrybsFBQLIOAcxOzQHIJ0P3SksFLHa-1ZRByoXD4Uu3E-_xMEp37dUXBJiYk1pKqw8nkX7smo-QxTJIN-jtsdwye6AAvTMMN4-Bm7lgiUCggE-&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 8.99,
        "currencyCode": "USD"
      }
    }
  },
  {
    "id": "tM82AwAAQBAJ",
    "volumeInfo": {
      "title": "Festín de cuervos (Canción de Hielo y Fuego 4)",
      "authors": [
        "George R. R. Martin"
      ],
      "description": "<p>Luego de siglos de guerras descarnadas, los siete poderes que dividen la tierra han alcanzado una difícil tregua. Pero no pasa mucho tiempo antes de que los sobrevivientes, los proscritos, los renegados y los carroñeros de los Siete Reinos se reúnan...</p> <p> <b> <i>Festín de cuervos</i> es el cuarto volumen de Canción de hielo y fuego, la monumental saga de fantasía épica del escritor George R. R. Martin que ha vendido más de 20 millones de ejemplares en todo el mundo.</b> </p> <p> <b>La saga que inspiró la filmación de la aclamada serie televisiva de HBO: <i>Game of Thrones</i>.</b> </p> <p>Cuando se apaga el clamor de las espadas, solamente queda carroña para los cuervos. Luego de siglos de guerras descarnadas, los siete poderes que dividen la tierra se han diezmado unos a otros hasta alcanzar una difícil tregua. Muy pocos reclamos legítimos existen ya por el Trono de Hierro, y la guerra que ha convertido al mundo en poco más que un desierto al fin ha terminado. O eso parece. Pero no pasa mucho tiempo antes de que los sobrevivientes, los proscritos, los renegados y los carroñeros de los Siete Reinos se reúnan.</p> <p>Ahora, como cuervos humanos que acechan un banquete de cenizas, nuevas intrigas y peligrosas alianzas se forman, a la vez que rostros sorprendentes algunos familiares, otros desconocidos emergen de un siniestro crepúsculo de caos y luchas pasadas para asumir los desafíos de los terribles tiempos que se avecinan. Nobles y plebeyos, soldados y hechiceros, asesinos y sabios se unen para hacer valer su vida y sus fortunas. Porque en un festín de cuervos, muchos son los invitados... pero sólo unos pocos logran sobrevivir.</p>",
      "imageLinks": {
        "large": "https://books.google.com/books/publisher/content?id=tM82AwAAQBAJ&printsec=frontcover&img=1&zoom=4&edge=curl&imgtk=AFLRE72Tfmt8jcmZQuwuN8W26mudP6lvcQ046K9LNE6PXVTLrv2onVQqOaUgnt4uAe1WXwLlzlyIrxmTL6iT_WBb3KfpYwwOTdZo1fjmshfIl2HKB_Fpgng4tFE803-Az-e9j4yRwt_g&source=gbs_api"
      }
    },
    "saleInfo": {
      "listPrice": {
        "amount": 15.99,
        "currencyCode": "USD"
      }
    }
  }
]